# Combining Dataset: concat & append

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Defining a function to create a DataFrame

def create_df(cols,ind):
    '''Quickly creating a dataframe'''
    data = {c:[str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data)
create_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [3]:
# Recall: cocncatenation of numpy arrays

x = [1,2,3,4]
y = [3,4,5,6]   # Combining the contents of two or more arrays into a single array
z = [4,5,6,7]

np.concatenate((x,y,z))

array([1, 2, 3, 4, 3, 4, 5, 6, 4, 5, 6, 7])

In [4]:
# Simple concatenation with pd.concat
# pd.concat() can be used concatenate series or dataframe

ser1 = pd.Series(['A','B','C'], index = [1,2,3])
ser2 = pd.Series(['E', 'F', 'G'], index = [4,5,6])
pd.concat([ser1,ser2])

# It also work with DataFrames

df1 = create_df('AB', [1,2])
df2 = create_df('CD',[3,4])

print(df1); print(df2); print(pd.concat([df1,df2]))

# Concatenating along the column

print(df1); print(df2); print(pd.concat([df1,df2], axis =1))

    A   B
0  A1  B1
1  A2  B2
    C   D
0  C3  D3
1  C4  D4
     A    B    C    D
0   A1   B1  NaN  NaN
1   A2   B2  NaN  NaN
0  NaN  NaN   C3   D3
1  NaN  NaN   C4   D4
    A   B
0  A1  B1
1  A2  B2
    C   D
0  C3  D3
1  C4  D4
    A   B   C   D
0  A1  B1  C3  D3
1  A2  B2  C4  D4

C:\Users\Boluwatife\Anaconda3\lib\site-packages\ipykernel_launcher.py:13: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  del sys.path[0]

In [5]:

# Using verify_integrity flag in pandas to check if there are duplicates of indices in the result

x = create_df('AB',[0,1])
y = create_df('AB', [0,2])

x.index = y.index
print(x); print(y)
# pd.concat([x,y], verify_integrity=True)  # This will raise an error

# We can ignore the index by allowing the concatenate create a new integer index for the series
pd.concat([x,y], ignore_index=True)

# Concatenation with join
# Data with various column names

df3 = create_df('ABC', [1,2])
df4 = create_df('BCD', [3,4])
print(pd.concat([df3,df4], join='inner'))

# Using the join_axes argument
pd.concat([df3,df4], join_axes=[df3.columns])

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A0  B0
1  A2  B2
    B   C
0  B1  C1
1  B2  C2
0  B3  C3
1  B4  C4

     A   B   C
0   A1  B1  C1
1   A2  B2  C2
0  NaN  B3  C3
1  NaN  B4  C4

# Combining Data set: merge() and join()

In [6]:
# Categories of join
# one-to-one

df1 = pd.DataFrame({'employee':['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake','Sue'],
                    'hire_date':[2004,2012,2006,2014]})
df3 = pd.merge(df1,df2)

# Many-to-one

df4  = pd.DataFrame({'group':['Accounting', 'Engineeroing', 'HR'],
                     'supervisor': ['Carly', 'Guido', 'Steve']})

# Another example on many-to-one
dl1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],
                    'data1': range(7)})
dl2 = pd.DataFrame({'key': ['a','b','d'],
                    'data2': range(3)})
pd.merge(dl1,dl2, on='key')

# Seperating the value of the data if the column names are different
dl3 = pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],
                    'data1': range(7)})
dl4 = pd.DataFrame({'rkey': ['a','b','d'],
                    'data2': range(3)})
merged = pd.merge(dl3,dl4, right_on='rkey', left_on='lkey', how='left')

# Solving overlapping columns issues
left = pd.DataFrame({'key1':['foo', 'foo', 'bar'],
                     'key2':['one', 'two', 'one'],
                     'lval':[1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})
pd.merge(left,right, on='key1')


# pd.merge(df3,df4)
# print(df3)
# print(df4)
# print(pd.merge(df3,df4))

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [7]:
# The left_on and right_on keywords
# Merging data set with two different column names
df5 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [2000, 1200, 2190, 2320]})
pd.merge(df1, df5, left_on='employee', right_on='name')

  employee        group  name  salary
0      Bob   Accounting   Bob    2000
1     Jake  Engineering  Jake    1200
2     Lisa  Engineering  Lisa    2190
3      Sue           HR   Sue    2320

## Specifying set Arithmetic for joins

In [8]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                    columns= ['name', 'food'])
df7 = pd.DataFrame({'name':['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']}, columns = ['name', 'drink'])
print(df6); print(df7); print(pd.merge(df6,df7, how = 'right'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

##  Overlapping column name: The suffixes  keywords

In [9]:
# A case where two input dataframes have conflicting column names

df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
pd.merge(df8,df9, on='name')

# Using a custom suffix with the suffixes keyword instead of the default x and y

pd.merge(df8, df9, on='name', suffixes=['_left', '_right'])

   name  rank_left  rank_right
0   Bob          1           3
1  Jake          2           1
2  Lisa          3           4
3   Sue          4           2

## US State Data

In [10]:
# Reading the state abbreviation, areas and populations

pop = pd.read_csv('state-population.csv')
area = pd.read_csv('state-areas.csv')
abbrev = pd.read_csv('state-abbrevs.csv')

merge = pd.merge(pop,abbrev, how='outer', left_on='state/region', right_on='abbreviation')
merged = merge.drop('abbreviation', axis=1)

# Checking if there is any mismatches
merged.isnull().any()

# Figuring out the population info that is null
merged[merged['population'].isnull()].head()
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [11]:
final=pd.merge(merged, area, on='state', how='left')
final.isnull().any()
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [15]:
final.dropna(inplace=True)
final

     state/region     ages  year  population        state  area (sq. mi)
0              AL  under18  2012   1117489.0      Alabama        52423.0
1              AL    total  2012   4817528.0      Alabama        52423.0
2              AL  under18  2010   1130966.0      Alabama        52423.0
3              AL    total  2010   4785570.0      Alabama        52423.0
4              AL  under18  2011   1125763.0      Alabama        52423.0
5              AL    total  2011   4801627.0      Alabama        52423.0
6              AL    total  2009   4757938.0      Alabama        52423.0
7              AL  under18  2009   1134192.0      Alabama        52423.0
8              AL  under18  2013   1111481.0      Alabama        52423.0
9              AL    total  2013   4833722.0      Alabama        52423.0
10             AL    total  2007   4672840.0      Alabama        52423.0
11             AL  under18  2007   1132296.0      Alabama        52423.0
12             AL    total  2008   4718206.0      Alabama        52423.0
13             AL  under18  2008   1134927.0      Alabama        52423.0
14             AL    total  2005   4569805.0      Alabama        52423.0
15             AL  under18  2005   1117229.0      Alabama        52423.0
16             AL    total  2006   4628981.0      Alabama        52423.0
17             AL  under18  2006   1126798.0      Alabama        52423.0
18             AL    total  2004   4530729.0      Alabama        52423.0
19             AL  under18  2004   1113662.0      Alabama        52423.0
20             AL    total  2003   4503491.0      Alabama        52423.0
21             AL  under18  2003   1113083.0      Alabama        52423.0
22             AL    total  2001   4467634.0      Alabama        52423.0
23             AL  under18  2001   1120409.0      Alabama        52423.0
24             AL    total  2002   4480089.0      Alabama        52423.0
25             AL  under18  2002   1116590.0      Alabama        52423.0
26             AL  under18  1999   1121287.0      Alabama        52423.0
27             AL    total  1999   4430141.0      Alabama        52423.0
28             AL    total  2000   4452173.0      Alabama        52423.0
29             AL  under18  2000   1122273.0      Alabama        52423.0
...           ...      ...   ...         ...          ...            ...
2446           WY  under18  1990    136078.0      Wyoming        97818.0
2447           WY    total  1990    453690.0      Wyoming        97818.0
2468           PR    total  2000   3810605.0  Puerto Rico         3515.0
2469           PR  under18  2000   1089063.0  Puerto Rico         3515.0
2470           PR    total  2001   3818774.0  Puerto Rico         3515.0
2471           PR  under18  2001   1077566.0  Puerto Rico         3515.0
2472           PR    total  2002   3823701.0  Puerto Rico         3515.0
2473           PR  under18  2002   1065051.0  Puerto Rico         3515.0
2474           PR    total  2004   3826878.0  Puerto Rico         3515.0
2475           PR  under18  2004   1035919.0  Puerto Rico         3515.0
2476           PR    total  2003   3826095.0  Puerto Rico         3515.0
2477           PR  under18  2003   1050615.0  Puerto Rico         3515.0
2478           PR    total  2005   3821362.0  Puerto Rico         3515.0
2479           PR  under18  2005   1019447.0  Puerto Rico         3515.0
2480           PR    total  2006   3805214.0  Puerto Rico         3515.0
2481           PR  under18  2006    998543.0  Puerto Rico         3515.0
2482           PR    total  2007   3782995.0  Puerto Rico         3515.0
2483           PR  under18  2007    973613.0  Puerto Rico         3515.0
2484           PR    total  2008   3760866.0  Puerto Rico         3515.0
2485           PR  under18  2008    945705.0  Puerto Rico         3515.0
2486           PR  under18  2013    814068.0  Puerto Rico         3515.0
2487           PR    total  2013   3615086.0  Puerto Rico         3515.0
2488           PR    total  2009   3740410.0  Puerto Rico         3515.0
2489           PR  under18  2009    920794.0  Puerto Rico         3515.0
2490           PR    total  2010   3721208.0  Puerto Rico         3515.0
2491           PR  under18  2010    896945.0  Puerto Rico         3515.0
2492           PR  under18  2011    869327.0  Puerto Rico         3515.0
2493           PR    total  2011   3686580.0  Puerto Rico         3515.0
2494           PR  under18  2012    841740.0  Puerto Rico         3515.0
2495           PR    total  2012   3651545.0  Puerto Rico         3515.0

[2476 rows x 6 columns]

In [20]:
data2010 = final.query("year==2010 & ages == 'total'")
data2010.set_index('state', inplace=True)
density = data2010['population']/data2010['area (sq. mi)']
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64